Revit 2026 API

# UIViewClose Method

---

Closes the view.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Close()
```
```vb
Public Sub Close
```
```cpp
public:
void Close()
```
```fsharp
member Close : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Cannot close a project's only open view. |

#### Reference

UIView Class

Autodesk.Revit.UI Namespace